Repository: ib729/yt-dlp-gui
Catalog: yt-dlp-gui/*.lproj/Localizable.strings
Languages: es, fr, hi, ja, ru, zh_hans, zh_hant

# status_remux_failed_fallback
source: Remuxing failed - falling back to conversion
es: Remultiplexado fallido; se procederá a convertir
fr: Remux échoué — conversion en cours
hi: रिमक्स असफल, अब कन्वर्ज़न किया जाएगा
ja: リマックスに失敗しました。変換を実行します
ru: Ремукс не удался — выполняем перекодирование
zh_hans: 重新封装失败，将改用重新编码
zh_hant: 重新封裝失敗，改為進行轉檔

# status_conversion_in_progress
source: Converting to %@ (re-encoding)...
es: Convirtiendo a %@ (re-codificando)…
fr: Conversion vers %@ (ré-encodage)…
hi: %@ में कन्वर्ट किया जा रहा है (पुनः एन्कोडिंग)…
ja: %@ へ変換中（再エンコード）…
ru: Конвертация в %@ (с перекодированием)…
zh_hans: 正在转换为 %@（重新编码）…
zh_hant: 正在轉換為 %@（重新編碼）…

# status_conversion_complete
source: Conversion completed successfully!
es: Conversión completada correctamente.
fr: Conversion terminée avec succès !
hi: कन्वर्ज़न सफलतापूर्वक पूरा हुआ!
ja: 変換が完了しました！
ru: Конвертация успешно завершена!
zh_hans: 转换完成！
zh_hant: 轉檔完成！

# status_conversion_failed
source: Conversion failed
es: Conversión fallida
fr: Échec de la conversion
hi: कन्वर्ज़न विफल
ja: 変換に失敗しました
ru: Конвертация не удалась
zh_hans: 转换失败
zh_hant: 轉檔失敗

# status_conversion_start_failed
source: Failed to start conversion: %@
es: No se pudo iniciar la conversión: %@
fr: Impossible de lancer la conversion : %@
hi: कन्वर्ज़न प्रारंभ नहीं हो सका: %@
ja: 変換を開始できませんでした: %@
ru: Не удалось запустить конвертацию: %@
zh_hans: 无法启动转换：%@
zh_hant: 無法啟動轉檔：%@

# status_error_ytdlp_missing
source: Error: yt-dlp not found. Please install it via Homebrew: %@
es: Error: no se encontró yt-dlp. Instálalo con Homebrew: %@
fr: Erreur : yt-dlp introuvable. Installez-le via Homebrew : %@
hi: त्रुटि: yt-dlp नहीं मिला। कृपया Homebrew से चलाएँ: %@
ja: エラー: yt-dlp が見つかりません。Homebrew で次を実行してください: %@
ru: Ошибка: yt-dlp не найден. Установите через Homebrew: %@
zh_hans: 错误：未找到 yt-dlp。请执行 %@ 安装。
zh_hant: 錯誤：找不到 yt-dlp。請透過 Homebrew 安裝：%@

# status_error_ytdlp_missing_path
source: Error: yt-dlp not found at path: %@
es: Error: no se encontró yt-dlp en la ruta: %@
fr: Erreur : yt-dlp introuvable au chemin : %@
hi: त्रुटि: पाथ %@ पर yt-dlp नहीं मिला।
ja: エラー: yt-dlp がパス %@ に見つかりません。
ru: Ошибка: yt-dlp не найден по пути: %@
zh_hans: 错误：在路径 %@ 未找到 yt-dlp。
zh_hant: 錯誤：在路徑 %@ 找不到 yt-dlp。

# status_starting_single_download
source: Starting download...
es: Iniciando descarga…
fr: Lancement du téléchargement…
hi: डाउनलोड प्रारंभ हो रहा है…
ja: ダウンロードを開始しています…
ru: Запуск загрузки…
zh_hans: 正在开始下载…
zh_hant: 正在開始下載…

# status_starting_multiple_downloads
source: Starting downloads (%d items)...
es: Iniciando descargas (%d elementos)…
fr: Lancement des téléchargements (%d éléments)…
hi: डाउनलोड प्रारंभ हो रहे हैं (%d आइटम)…
ja: ダウンロードを開始しています（全 %d 件）…
ru: Запуск загрузок (%d элементов)…
zh_hans: 正在开始下载（共 %d 个项目）…
zh_hant: 正在開始下載（共 %d 個項目）…

# status_download_complete
source: Download completed successfully!
es: Descarga completada correctamente.
fr: Téléchargement terminé avec succès !
hi: डाउनलोड सफलतापूर्वक पूरा हुआ!
ja: ダウンロードが完了しました！
ru: Загрузка успешно завершена!
zh_hans: 下载完成！
zh_hant: 下載完成！

# status_download_failed_code
source: Download failed with exit code %d
es: Descarga fallida con código de salida %d
fr: Téléchargement échoué avec le code %d
hi: डाउनलोड एग्ज़िट कोड %d के साथ विफल हुआ
ja: ダウンロードが終了コード %d で失敗しました
ru: Загрузка завершилась с кодом %d
zh_hans: 下载失败，退出代码 %d
zh_hant: 下載失敗，退出代碼 %d

# status_download_start_failed
source: Failed to start download: %@
es: No se pudo iniciar la descarga: %@
fr: Impossible de démarrer le téléchargement : %@
hi: डाउनलोड प्रारंभ करने में विफल: %@
ja: ダウンロードを開始できませんでした: %@
ru: Не удалось запустить загрузку: %@
zh_hans: 无法启动下载：%@
zh_hant: 無法啟動下載：%@

# status_eta_format
source: ETA %@
fr: Temps restant %@
hi: अनुमानित समय %@
ja: 残り時間 %@
zh_hans: 预计剩余 %@
zh_hant: 預估剩餘 %@

# status_download_cancelled
source: Download cancelled
es: Descarga cancelada
fr: Téléchargement annulé
hi: डाउनलोड रद्द किया गया
ja: ダウンロードをキャンセルしました
ru: Загрузка отменена
zh_hans: 下载已取消
zh_hant: 下載已取消

# status_no_subtitles_available
source: No subtitles available for this video
es: No hay subtítulos disponibles para este video
ja: この動画には字幕がありません
zh_hans: 此视频没有可用的字幕

# settings_language_option_hindi
source: हिन्दी
ru: Хинди

# content_header_version_format
source: v%@
zh_hans: 版本 %@
zh_hant: 版本 %@
