Repository: ib729/yt-dlp-gui
Catalog: yt-dlp-gui/*.lproj/Localizable.strings
Languages: es, fr, hi, ja, ru, zh_hans, zh_hant

# content_header_settings
source: Settings
es: Ajustes
fr: Réglages
hi: सेटिंग्स
ja: 設定
ru: Настройки
zh_hans: 设置
zh_hant: 設定

# session_log_title
source: Session Log
es: Registro de sesión
fr: Journal de session
hi: सत्र लॉग
ja: セッションログ
ru: Журнал сеанса
zh_hans: 会话日志
zh_hant: 工作階段記錄

# session_log_copy
source: Copy
es: Copiar
fr: Copier
hi: कॉपी
ja: コピー
ru: Копировать
zh_hans: 复制
zh_hant: 複製

# session_log_clear
source: Clear
es: Limpiar
fr: Effacer
hi: साफ़ करें
ja: クリア
ru: Очистить
zh_hans: 清除
zh_hant: 清除

# url_input_title
source: Video/Playlist URLs
es: URL de video/lista de reproducción
fr: URL vidéo/liste de lecture
hi: वीडियो/प्लेलिस्ट URL
ja: 動画 / プレイリスト URL
ru: URL видео/плейлиста
zh_hans: 视频/播放列表链接
zh_hant: 影片／播放清單連結

# url_input_placeholder
source: Enter video or playlist URL(s)...
es: Introduce URL(s) de video o lista de reproducción…
fr: Saisissez une ou plusieurs URL de vidéo ou de playlist…
hi: वीडियो या प्लेलिस्ट URL दर्ज करें…
ja: 動画またはプレイリストの URL を入力…
ru: Введите URL видео или плейлиста…
zh_hans: 请输入视频或播放列表链接…
zh_hant: 請輸入影片或播放清單連結…

# url_input_help
source: Accepts full video or playlist links separated by commas from YouTube or any yt-dlp supported site.
es: Acepta enlaces completos de video o listas de reproducción de YouTube o cualquier sitio compatible con yt-dlp; separa varios enlaces con comas.
fr: Accepte les liens complets de vidéos ou de playlists provenant de YouTube ou de tout site pris en charge par yt-dlp ; séparez plusieurs liens par des virgules.
hi: YouTube या किसी भी yt-dlp समर्थित साइट के वीडियो और प्लेलिस्ट के पूर्ण लिंक स्वीकार करता है; कई लिंक को कॉमा से अलग करें।
ja: YouTube や yt-dlp が対応するサイトの動画・プレイリストの完全な URL を入力できます。複数指定する場合はカンマで区切ってください。
ru: Принимает полные ссылки на видео или плейлисты с YouTube и других сайтов, поддерживаемых yt-dlp; несколько ссылок разделяйте запятыми.
zh_hans: 支持输入 YouTube 或任何 yt-dlp 支持站点的完整视频或播放列表链接，多个链接用逗号分隔。
zh_hant: 支援輸入 YouTube 或任何 yt-dlp 支援站點的完整影片或播放清單連結，多個連結以逗號分隔。

# download_progress_title
source: Download Progress
es: Progreso de descarga
fr: Progression du téléchargement
hi: डाउनलोड प्रगति
ja: ダウンロード進行状況
ru: Ход загрузки
zh_hans: 下载进度
zh_hant: 下載進度

# download_progress_format
source: %d%% complete
es: %d%% completado
fr: %d%% terminés
hi: %d%% पूरा
ja: %d%% 完了
ru: %d%% завершено
zh_hans: %d%% 已完成
zh_hant: %d%% 已完成

# raw_output_title
source: Raw Output
es: Salida sin procesar
fr: Sortie brute
hi: कच्चा आउटपुट
ja: 生の出力
ru: Необработанный вывод
zh_hans: 原始输出
zh_hant: 原始輸出

# cancel_button
source: Cancel
es: Cancelar
fr: Annuler
hi: रद्द करें
ja: キャンセル
ru: Отменить
zh_hans: 取消
zh_hant: 取消

# download_button
source: Download
es: Descargar
fr: Télécharger
hi: डाउनलोड
ja: ダウンロード
ru: Скачать
zh_hans: 下载
zh_hant: 下載

# status_ytdlp_missing
source: ⚠️ yt-dlp not found. Install it with: %@
es: ⚠️ No se encontró yt-dlp. Instálalo con: %@
fr: ⚠️ yt-dlp est introuvable. Installez-le avec : %@
hi: ⚠️ yt-dlp नहीं मिला। इसे इंस्टॉल करने के लिए चलाएँ: %@
ja: ⚠️ yt-dlp が見つかりません。次のコマンドでインストールしてください: %@
ru: ⚠️ yt-dlp не найден. Установите командой: %@
zh_hans: ⚠️ 未找到 yt-dlp。请通过执行：%@ 安装。
zh_hant: ⚠️ 找不到 yt-dlp。請執行：%@ 進行安裝。

# status_ffmpeg_missing
source: ⚠️ ffmpeg not found. Install it with: %@
es: ⚠️ No se encontró ffmpeg. Instálalo con: %@
fr: ⚠️ ffmpeg est introuvable. Installez-le avec : %@
hi: ⚠️ ffmpeg नहीं मिला। इसे इंस्टॉल करने के लिए चलाएँ: %@
ja: ⚠️ ffmpeg が見つかりません。次のコマンドでインストールしてください: %@
ru: ⚠️ ffmpeg не найден. Установите командой: %@
zh_hans: ⚠️ 未找到 ffmpeg。请通过执行：%@ 安装。
zh_hant: ⚠️ 找不到 ffmpeg。請執行：%@ 進行安裝。

# status_ready
source: Ready to download
es: Listo para descargar
fr: Prêt à télécharger
hi: डाउनलोड के लिए तैयार
ja: ダウンロードの準備完了
ru: Готово к загрузке
zh_hans: 下载已就绪
zh_hant: 準備好下載

# about_description_fallback
source: A native SwiftUI interface for yt-dlp.
es: Una interfaz nativa de SwiftUI para yt-dlp.
fr: Interface SwiftUI native pour yt-dlp.
hi: yt-dlp के लिए एक नेटिव SwiftUI इंटरफ़ेस।
ja: yt-dlp のためのネイティブ SwiftUI インターフェイス。
ru: Нативный интерфейс SwiftUI для yt-dlp.
zh_hans: 用于 yt-dlp 的原生 SwiftUI 界面。
zh_hant: 用於 yt-dlp 的原生 SwiftUI 介面。

# about_version_label
source: Version
es: Versión
hi: संस्करण
ja: バージョン
ru: Версия
zh_hans: 版本
zh_hant: 版本

# about_donate_button
source: Donate
es: Donar
fr: Faire un don
hi: दान करें
ja: 支援する
ru: Поддержать
zh_hans: 捐助
zh_hant: 抖內

# settings_title
source: Settings
es: Configuración
fr: Réglages
hi: सेटिंग्स
ja: 設定
ru: Настройки
zh_hans: 设置
zh_hant: 設定

# settings_cancel
source: Cancel
es: Cancelar
fr: Annuler
hi: रद्द करें
ja: キャンセル
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# settings_save
source: Save
es: Guardar
fr: Enregistrer
hi: सहेजें
ja: 保存
ru: Сохранить
zh_hans: 保存
zh_hant: 儲存

# settings_section_general
source: General
fr: Général
hi: सामान्य
ja: 一般
ru: Общие
zh_hans: 常规
zh_hant: 一般

# settings_section_application
source: Application
es: Aplicación
hi: एप्लिकेशन
ja: アプリケーション
ru: Приложение
zh_hans: 应用
zh_hant: 應用程式

# settings_field_language
source: Language
es: Idioma
fr: Langue
hi: भाषा
ja: 言語
ru: Язык
zh_hans: 界面语言
zh_hant: 語言

# settings_picker_language
source: Language
es: Idioma
fr: Langue
hi: भाषा
ja: 言語
ru: Язык
zh_hans: 界面语言
zh_hant: 語言

# settings_language_option_system
source: System Default
es: Seguir idioma del sistema
fr: Suivre la langue du système
hi: सिस्टम भाषा का पालन करें
ja: システムの言語に従う
ru: Следовать языку системы
zh_hans: 跟随系统
zh_hant: 跟隨系統

# settings_language_option_english
source: English
hi: अंग्रेज़ी
ru: Английский

# settings_language_option_german
source: Deutsch
hi: जर्मन
ru: Немецкий

# settings_language_option_french
source: Français
hi: फ़्रेंच
ru: Французский

# settings_language_option_spanish
source: Español
hi: स्पैनिश
ru: Испанский

# settings_language_option_russian
source: Русский
hi: रूसी

# settings_language_option_japanese
source: 日本語
hi: जापानी
ru: Японский

# settings_language_option_chinese_simplified
source: 简体中文
hi: सरलीकृत चीनी
ru: Китайский (упрощённый)

# settings_language_option_chinese_traditional
source: 正體中文
hi: पारंपरिक चीनी
ru: Китайский (традиционный)

# settings_language_restart
source: Language changes take effect after restarting the app.
es: Los cambios de idioma se aplicarán tras reiniciar la app.
fr: Les modifications de langue prendront effet après le redémarrage de l’application.
hi: भाषा परिवर्तन ऐप को पुनः आरंभ करने के बाद लागू होंगे।
ja: 言語を変更するとアプリ再起動後に反映されます。
ru: Изменение языка вступит в силу после перезапуска приложения.
zh_hans: 语言更改将在应用重新启动后生效。
zh_hant: 重新啟動 App 後語言變更才會生效。

# settings_field_output_directory
source: Output Directory
es: Directorio de salida
fr: Dossier de sortie
hi: आउटपुट निर्देशिका
ja: 出力フォルダ
ru: Каталог вывода
zh_hans: 输出目录
zh_hant: 輸出資料夾

# settings_browse_button
source: Browse
es: Examinar
fr: Parcourir
hi: ब्राउज़ करें
ja: 参照
ru: Обзор
zh_hans: 浏览
zh_hant: 瀏覽

# settings_field_custom_ytdlp_path
source: Custom yt-dlp Path
es: Ruta personalizada de yt-dlp
fr: Chemin personnalisé pour yt-dlp
hi: कस्टम yt-dlp पाथ
ja: yt-dlp のカスタムパス
ru: Путь к yt-dlp
zh_hans: 自定义 yt-dlp 路径
zh_hant: 自訂 yt-dlp 路徑

# settings_field_custom_ffmpeg_path
source: Custom FFmpeg Path
es: Ruta personalizada de FFmpeg
fr: Chemin personnalisé pour FFmpeg
hi: कस्टम FFmpeg पाथ
ja: FFmpeg のカスタムパス
ru: Путь к FFmpeg
zh_hans: 自定义 FFmpeg 路径
zh_hant: 自訂 FFmpeg 路徑

# settings_autodetect_placeholder
source: Auto-detect
es: Detección automática
fr: Détection automatique
hi: स्वतः पहचानें
ja: 自動検出
ru: Автоопределение
zh_hans: 自动检测
zh_hant: 自動偵測

# settings_ytdlp_missing_footer
source: yt-dlp powers downloads. Install with: %@
es: yt-dlp ejecuta las descargas. Instálalo con: %@
fr: yt-dlp gère les téléchargements. Installez-le avec : %@
hi: yt-dlp डाउनलोड प्रक्रिया चलाता है। इसे इंस्टॉल करने के लिए चलाएँ: %@
ja: yt-dlp がダウンロード処理を行います。次を実行してください: %@
ru: yt-dlp выполняет загрузки. Установите командой: %@
zh_hans: yt-dlp 用于执行下载。请运行：%@
zh_hant: yt-dlp 用於執行下載。請執行：%@

# settings_ffmpeg_missing_footer
source: FFmpeg is required for audio extraction and video processing. Install with: %@
es: FFmpeg es necesario para extraer audio y procesar video. Instálalo con: %@
fr: FFmpeg est requis pour l’extraction audio et le traitement vidéo. Installez-le avec : %@
hi: FFmpeg ऑडियो निकालने और वीडियो प्रोसेसिंग के लिए आवश्यक है। इसे इंस्टॉल करने के लिए चलाएँ: %@
ja: FFmpeg は音声抽出と動画処理に必要です。次を実行してください: %@
ru: FFmpeg требуется для извлечения аудио и обработки видео. Установите командой: %@
zh_hans: FFmpeg 用于音频提取和视频处理。请运行：%@
zh_hant: FFmpeg 可處理音訊擷取與影片轉檔。請執行：%@

# settings_cookies_loaded_format
source: %d cookies loaded
es: Se cargaron %d cookies
fr: %d cookies chargés
hi: %d कुकीज़ लोड हुईं
ja: Cookie を %d 件読み込みました
ru: Загружено cookies: %d
zh_hans: 已加载 %d 条 Cookie
zh_hant: 已載入 %d 個 Cookie

# settings_section_video
source: Video
fr: Vidéo
hi: वीडियो
ja: 動画
ru: Видео
zh_hans: 视频
zh_hant: 影片

# settings_field_video_format
source: Video Format
es: Formato de video
fr: Format vidéo
hi: वीडियो फ़ॉर्मेट
ja: 動画フォーマット
ru: Формат видео
zh_hans: 视频格式
zh_hant: 影片格式

# settings_picker_video_format
source: Video Format
es: Formato de video
fr: Format vidéo
hi: वीडियो फ़ॉर्मेट
ja: 動画フォーマット
ru: Формат видео
zh_hans: 视频格式
zh_hant: 影片格式

# settings_option_video_best
source: Best Available
es: Mejor disponible
fr: Meilleur disponible
hi: श्रेष्ठ उपलब्ध
ja: 最適
ru: Лучшее доступное
zh_hans: 最佳可用
zh_hant: 最佳可用

# settings_field_resolution_cap
source: Resolution Cap
es: Límite de resolución
fr: Limite de résolution
hi: रेज़ोल्यूशन सीमा
ja: 解像度上限
ru: Ограничение разрешения
zh_hans: 分辨率上限
zh_hant: 解析度上限

# settings_picker_video_quality
source: Video Quality
es: Calidad de video
fr: Qualité vidéo
hi: वीडियो गुणवत्ता
ja: 動画品質
ru: Качество видео
zh_hans: 视频质量
zh_hant: 影片品質

# settings_option_quality_best
source: Best Available
es: Mejor disponible
fr: Meilleur disponible
hi: श्रेष्ठ उपलब्ध
ja: 最適
ru: Лучшее доступное
zh_hans: 最佳可用
zh_hant: 最佳可用

# settings_field_preferred_codec
source: Preferred Codec
es: Códec preferido
fr: Codec préféré
hi: पसंदीदा कोडेक
ja: 優先コーデック
ru: Предпочтительный кодек
zh_hans: 首选编码
zh_hant: 偏好編碼

# settings_picker_video_codec
source: Video Codec
es: Códec de video
fr: Codec vidéo
hi: वीडियो कोडेक
ja: 動画コーデック
ru: Видеокодек
zh_hans: 视频编码
zh_hant: 影片編碼

# settings_option_codec_auto
source: Auto
es: Automático
fr: Automatique
hi: स्वतः
ja: 自動
ru: Автоматически
zh_hans: 自动
zh_hant: 自動

# settings_video_codec_help
source: Prefers libsvtav1 when available, falling back to libaom-av1.
es: Prefiere libsvtav1 cuando está disponible y, si no, usa libaom-av1.
fr: Privilégie libsvtav1 lorsque disponible et sinon libaom-av1.
hi: उपलब्ध होने पर libsvtav1 को प्राथमिकता देता है, अन्यथा libaom-av1 का उपयोग करता है।
ja: libsvtav1 が利用可能な場合は優先し、利用できない場合は libaom-av1 にフォールバックします。
ru: Предпочитает libsvtav1 и при необходимости использует libaom-av1.
zh_hans: 优先使用 libsvtav1，如不可用则回退到 libaom-av1。
zh_hant: 優先使用 libsvtav1，若不可用則改用 libaom-av1。

# settings_section_audio
source: Audio
hi: ऑडियो
ja: 音声
ru: Аудио
zh_hans: 音频
zh_hant: 音訊

# settings_toggle_audio_only
source: Audio Only
es: Solo audio
fr: Audio uniquement
hi: केवल ऑडियो
ja: 音声のみ
ru: Только аудио
zh_hans: 仅下载音频
zh_hant: 只下載音訊

# settings_field_audio_format
source: Audio Format
es: Formato de audio
fr: Format audio
hi: ऑडियो फ़ॉर्मेट
ja: 音声フォーマット
ru: Формат аудио
zh_hans: 音频格式
zh_hant: 音訊格式

# settings_picker_audio_format
source: Audio Format
es: Formato de audio
fr: Format audio
hi: ऑडियो फ़ॉर्मेट
ja: 音声フォーマット
ru: Формат аудио
zh_hans: 音频格式
zh_hant: 音訊格式

# settings_field_audio_bitrate
source: Bitrate
es: Tasa de bits
fr: Débit binaire
hi: बिटरेट
ja: ビットレート
ru: Битрейт
zh_hans: 比特率
zh_hant: 位元率

# settings_picker_audio_quality
source: Audio Quality
es: Calidad de audio
fr: Qualité audio
hi: ऑडियो गुणवत्ता
ja: 音声品質
ru: Качество аудио
zh_hans: 音频质量
zh_hant: 音訊品質

# settings_option_bitrate_320
source: 320 kbps
fr: 320 kb/s
hi: 320 kb/s
ja: 320 kb/s

# settings_option_bitrate_256
source: 256 kbps
fr: 256 kb/s
hi: 256 kb/s
ja: 256 kb/s

# settings_option_bitrate_192
source: 192 kbps
fr: 192 kb/s
hi: 192 kb/s
ja: 192 kb/s

# settings_option_bitrate_128
source: 128 kbps
fr: 128 kb/s
hi: 128 kb/s
ja: 128 kb/s

# settings_option_bitrate_96
source: 96 kbps
fr: 96 kb/s
hi: 96 kb/s
ja: 96 kb/s

# settings_option_bitrate_64
source: 64 kbps
fr: 64 kb/s
hi: 64 kb/s
ja: 64 kb/s

# settings_toggle_keep_video
source: Keep video file after extraction
es: Conservar el video tras la extracción
fr: Conserver la vidéo après l’extraction
hi: निकालने के बाद भी वीडियो रखें
ja: 音声抽出後も動画を保持
ru: Сохранять видео после извлечения
zh_hans: 提取后保留视频文件
zh_hant: 匯出後保留影片

# settings_section_post_processing
source: Post-Processing
es: Posprocesado
fr: Post-traitement
hi: पोस्ट-प्रोसेसिंग
ja: ポストプロセス
ru: Постобработка
zh_hans: 后期处理
zh_hant: 後處理

# settings_toggle_force_conversion
source: Force conversion
es: Forzar conversión
fr: Forcer la conversion
hi: कन्वर्ज़न बाध्य करें
ja: 変換を強制
ru: Принудительное преобразование
zh_hans: 强制转换
zh_hant: 強制轉檔

# settings_toggle_delete_original
source: Delete original after conversion
es: Eliminar original tras la conversión
fr: Supprimer l’original après conversion
hi: कन्वर्ज़न के बाद मूल हटाएँ
ja: 変換後に元ファイルを削除
ru: Удалять оригинал после преобразования
zh_hans: 转换后删除原始文件
zh_hant: 轉檔後刪除原始檔案

# settings_text_force_conversion_warning
source: Forcing conversion re-encodes media even when the source matches your target format.
es: Forzar la conversión vuelve a codificar el medio incluso si la fuente coincide con el formato deseado.
fr: Forcer la conversion ré-encode le média même si la source correspond déjà au format cible.
hi: चाहे स्रोत लक्ष्य फ़ॉर्मेट से मेल खाता हो, कन्वर्ज़न बाध्य करने पर मीडिया फिर से एन्कोड होगा।
ja: 強制変換を有効にすると、ソースが希望フォーマットでも再エンコードされます。
ru: Принудительное преобразование перекодирует медиа даже если источник соответствует целевому формату.
zh_hans: 即使源文件已经符合目标格式，强制转换也会重新编码。
zh_hant: 即便來源已符合目標格式，強制轉檔仍會重新編碼媒體。

# settings_section_subtitles
source: Subtitles
es: Subtítulos
fr: Sous-titres
hi: सबटाइटल
ja: 字幕
ru: Субтитры
zh_hans: 字幕
zh_hant: 字幕

# settings_toggle_download_subtitles
source: Download subtitles
es: Descargar subtítulos
fr: Télécharger les sous-titres
hi: सबटाइटल डाउनलोड करें
ja: 字幕をダウンロード
ru: Загружать субтитры
zh_hans: 下载字幕
zh_hant: 下載字幕

# settings_field_subtitle_languages
source: Languages
es: Idiomas
fr: Langues
hi: भाषाएँ
ja: 言語
ru: Языки
zh_hans: 语言
zh_hant: 語言

# settings_placeholder_language_examples
source: e.g. en,es,fr
es: p. ej. en,es,fr
fr: ex. : en,es,fr
hi: उदा.: en,es,fr
ja: 例: en,es,fr
ru: например en,es,fr
zh_hans: 例如：en,es,fr
zh_hant: 例如：en,es,fr

# settings_field_subtitle_format
source: Subtitle Format
es: Formato de subtítulo
fr: Format des sous-titres
hi: सबटाइटल फ़ॉर्मेट
ja: 字幕フォーマット
ru: Формат субтитров
zh_hans: 字幕格式
zh_hant: 字幕格式

# settings_picker_subtitle_format
source: Subtitle Format
es: Formato de subtítulo
fr: Format des sous-titres
hi: सबटाइटल फ़ॉर्मेट
ja: 字幕フォーマット
ru: Формат субтитров
zh_hans: 字幕格式
zh_hant: 字幕格式

# settings_toggle_embed_subtitles
source: Embed subtitles into video
es: Incrustar subtítulos en el video
fr: Intégrer les sous-titres dans la vidéo
hi: सबटाइटल को वीडियो में एम्बेड करें
ja: 字幕を動画に埋め込み
ru: Встраивать субтитры в видео
zh_hans: 将字幕嵌入视频
zh_hant: 將字幕嵌入影片

# settings_toggle_download_auto_subtitles
source: Download auto-generated subtitles
es: Descargar subtítulos automáticos
fr: Télécharger les sous-titres automatiques
hi: स्वतः उत्पन्न सबटाइटल डाउनलोड करें
ja: 自動生成字幕を取得
ru: Загружать автоматически созданные субтитры
zh_hans: 下载自动生成字幕
zh_hant: 下載自動產生字幕

# settings_toggle_subtitle_only
source: Subtitle only (skip media)
es: Solo subtítulos (omitir medios)
fr: Sous-titres uniquement (sans média)
hi: केवल सबटाइटल (मीडिया नहीं)
ja: 字幕のみ（メディアなし）
ru: Только субтитры (без медиа)
zh_hans: 仅字幕（跳过媒体）
zh_hant: 僅字幕（略過媒體）

# settings_section_metadata
source: Metadata & Thumbnails
es: Metadatos y miniaturas
fr: Métadonnées & miniatures
hi: मेटाडेटा और थंबनेल
ja: メタデータとサムネイル
ru: Метаданные и миниатюры
zh_hans: 元数据与缩略图
zh_hant: 中繼資料與縮圖

# settings_toggle_download_thumbnail
source: Download thumbnail
es: Descargar miniatura
fr: Télécharger la miniature
hi: थंबनेल डाउनलोड करें
ja: サムネイルを取得
ru: Загружать миниатюру
zh_hans: 下载缩略图
zh_hant: 下載縮圖

# settings_toggle_embed_thumbnail
source: Embed thumbnail in media file
es: Incrustar miniatura en el archivo
fr: Intégrer la miniature au fichier
hi: थंबनेल को फ़ाइल में जोड़ें
ja: サムネイルをファイルに埋め込み
ru: Встраивать миниатюру в файл
zh_hans: 将缩略图嵌入媒体文件
zh_hant: 將縮圖嵌入媒體檔

# settings_toggle_save_description
source: Save video description
es: Guardar descripción del video
fr: Enregistrer la description de la vidéo
hi: वीडियो विवरण सहेजें
ja: 動画の説明を保存
ru: Сохранять описание видео
zh_hans: 保存视频说明
zh_hant: 儲存影片說明

# settings_toggle_save_info_json
source: Save info JSON
es: Guardar info JSON
fr: Enregistrer le JSON d’information
hi: info JSON सहेजें
ja: info JSON を保存
ru: Сохранять info JSON
zh_hans: 保存信息 JSON
zh_hant: 儲存 info JSON

# settings_section_playlists
source: Playlists
es: Listas de reproducción
hi: प्लेलिस्ट
ja: プレイリスト
ru: Плейлисты
zh_hans: 播放列表
zh_hant: 播放清單

# settings_toggle_single_video
source: Download single video only
es: Descargar solo un video
fr: Télécharger une seule vidéo
hi: केवल एक वीडियो डाउनलोड करें
ja: 単一動画のみダウンロード
ru: Загружать только одно видео
zh_hans: 仅下载单个视频
zh_hant: 僅下載單支影片

# settings_field_max_downloads
source: Max downloads
es: Máximo de descargas
fr: Téléchargements maximum
hi: अधिकतम डाउनलोड
ja: 最大ダウンロード数
ru: Максимум загрузок
zh_hans: 最大下载数量
zh_hant: 最大下載數

# settings_placeholder_unlimited
source: Unlimited
es: Sin límite
fr: Illimité
hi: असीमित
ja: 制限なし
ru: Без ограничений
zh_hans: 无限制
zh_hant: 無限制

# settings_section_network
source: Network
es: Red
fr: Réseau
hi: नेटवर्क
ja: ネットワーク
ru: Сеть
zh_hans: 网络
zh_hant: 網路

# settings_field_rate_limit
source: Rate limit
es: Límite de velocidad
fr: Limitation du débit
hi: रेट लिमिट
ja: 帯域制限
ru: Ограничение скорости
zh_hans: 速率限制
zh_hant: 速率限制

# settings_placeholder_rate_limit
source: e.g. 1M
es: p. ej. 1M
fr: ex. : 1M
hi: उदा.: 1M
ja: 例: 1M
ru: например 1M
zh_hans: 例如：1M
zh_hant: 例如：1M

# settings_field_retries
source: Retries
es: Reintentos
fr: Tentatives
hi: पुनः प्रयास
ja: 再試行回数
ru: Повторы
zh_hans: 重试次数
zh_hant: 重試次數

# settings_field_proxy
source: Proxy
hi: प्रॉक्सी
ja: プロキシ
ru: Прокси
zh_hans: 代理
zh_hant: 代理伺服器

# settings_field_user_agent
source: User agent
es: Agente de usuario
fr: Agent utilisateur
hi: यूज़र एजेंट
ja: ユーザーエージェント
zh_hans: 用户代理

# settings_placeholder_user_agent
source: Default
es: Predeterminado
fr: Par défaut
hi: डिफ़ॉल्ट
ja: 既定
ru: По умолчанию
zh_hans: 默认
zh_hant: 預設

# settings_section_logging
source: Logging & Debug
es: Registro y depuración
fr: Journalisation & débogage
hi: लॉगिंग और डीबग
ja: ログとデバッグ
ru: Логи и отладка
zh_hans: 日志与调试
zh_hant: 記錄與偵錯

# settings_toggle_verbose_logging
source: Enable verbose logging
es: Habilitar registro detallado
fr: Activer la journalisation détaillée
hi: विस्तृत लॉग सक्षम करें
ja: 詳細ログを有効化
ru: Включить подробные логи
zh_hans: 启用详细日志
zh_hant: 啟用詳細記錄

# settings_toggle_show_raw_output
source: Show raw output
es: Mostrar salida sin procesar
fr: Afficher la sortie brute
hi: कच्चा आउटपुट दिखाएँ
ja: 生の出力を表示
ru: Показывать исходный вывод
zh_hans: 显示原始输出
zh_hant: 顯示原始輸出

# settings_toggle_log_commands
source: Log command invocations
es: Registrar invocaciones de comandos
fr: Journaliser les commandes
hi: कमांड कॉल रिकॉर्ड करें
ja: コマンド呼び出しを記録
ru: Логировать вызовы команд
zh_hans: 记录命令调用
zh_hant: 記錄指令呼叫

# settings_text_verbose_logging_info
source: Verbose logging streams the full yt-dlp output to the log panels.
es: El registro detallado muestra la salida completa de yt-dlp en los paneles de registro.
fr: La journalisation détaillée affiche la sortie complète de yt-dlp dans les panneaux de journal.
hi: विस्तृत लॉग सक्षम करने पर yt-dlp की पूरी आउटपुट लॉग पैनल में दिखाई देगी।
ja: 詳細ログを有効にすると、yt-dlp の出力全体がログパネルに表示されます。
ru: Подробные логи выводят полный результат yt-dlp в панели журналов.
zh_hans: 详细日志会把完整的 yt-dlp 输出显示在日志面板中。
zh_hant: 詳細記錄會將完整的 yt-dlp 輸出顯示在記錄面板。

# settings_section_authentication
source: Authentication
es: Autenticación
fr: Authentification
hi: प्रमाणीकरण
ja: 認証
ru: Аутентификация
zh_hans: 身份验证
zh_hant: 驗證

# settings_toggle_pass_browser_cookies
source: Pass cookies through browser
es: Pasar cookies mediante el navegador
fr: Utiliser les cookies du navigateur
hi: ब्राउज़र कुकीज़ का उपयोग करें
ja: ブラウザーの Cookie を利用
ru: Использовать cookies из браузера
zh_hans: 通过浏览器传递 Cookie
zh_hant: 透過瀏覽器傳遞 Cookie

# settings_browser_help
source: Supported browsers: Safari, Brave, Google Chrome, Chromium, Microsoft Edge, Firefox, Opera, Vivaldi.
es: Navegadores compatibles: Safari, Brave, Google Chrome, Chromium, Microsoft Edge, Firefox, Opera, Vivaldi.
fr: Navigateurs pris en charge : Safari, Brave, Google Chrome, Chromium, Microsoft Edge, Firefox, Opera, Vivaldi.
hi: समर्थित ब्राउज़र: Safari, Brave, Google Chrome, Chromium, Microsoft Edge, Firefox, Opera, Vivaldi।
ja: 対応ブラウザー: Safari、Brave、Google Chrome、Chromium、Microsoft Edge、Firefox、Opera、Vivaldi。
ru: Поддерживаемые браузеры: Safari, Brave, Google Chrome, Chromium, Microsoft Edge, Firefox, Opera, Vivaldi.
zh_hans: 支持的浏览器：Safari、Brave、Google Chrome、Chromium、Microsoft Edge、Firefox、Opera、Vivaldi。
zh_hant: 支援的瀏覽器：Safari、Brave、Google Chrome、Chromium、Microsoft Edge、Firefox、Opera、Vivaldi。

# settings_text_manual_cookie_disabled
source: Manual cookie input is disabled while pass-through is active.
es: La entrada manual de cookies se desactiva mientras esté activo el paso directo desde el navegador.
fr: La saisie manuelle des cookies est désactivée lorsque l’option navigateur est active.
hi: जब ब्राउज़र से कुकी पासथ्रू सक्षम हो, तब मैन्युअल इनपुट अक्षम रहता है।
ja: ブラウザーからの取得を有効化すると手動入力は無効になります。
ru: При активном получении cookies из браузера ручной ввод отключён.
zh_hans: 启用浏览器直传时将禁用手动输入 Cookie。
zh_hant: 啟用瀏覽器直通時會停用手動輸入 Cookie。

# settings_field_browser
source: Browser
es: Navegador
fr: Navigateur
hi: ब्राउज़र
ja: ブラウザー
ru: Браузер
zh_hans: 浏览器
zh_hant: 瀏覽器

# settings_browser_footer
source: yt-dlp will read cookies directly from the selected browser. Close the browser first for best results.
es: yt-dlp leerá las cookies directamente del navegador seleccionado. Cierra el navegador primero para mejores resultados.
fr: yt-dlp lira directement les cookies dans le navigateur sélectionné. Fermez le navigateur au préalable.
hi: yt-dlp चयनित ब्राउज़र से सीधे कुकीज़ पढ़ेगा। बेहतर परिणाम हेतु पहले ब्राउज़र बंद करें।
ja: yt-dlp は選択したブラウザーから直接 Cookie を読み取ります。事前にブラウザーを終了してください。
ru: yt-dlp считывает cookies напрямую из выбранного браузера. Перед этим закройте браузер.
zh_hans: yt-dlp 会直接从所选浏览器读取 Cookie。建议先关闭浏览器。
zh_hant: yt-dlp 會直接從選定的瀏覽器讀取 Cookie。建議先關閉瀏覽器。

# settings_picker_browser
source: Browser
es: Navegador
fr: Navigateur
hi: ब्राउज़र
ja: ブラウザー
ru: Браузер
zh_hans: 浏览器
zh_hant: 瀏覽器

# settings_text_cookies_title
source: Cookies (Netscape format)
es: Cookies (formato Netscape)
fr: Cookies (format Netscape)
hi: कुकी (Netscape फ़ॉर्मेट)
ja: Cookie（Netscape 形式）
ru: Cookies (формат Netscape)
zh_hans: Cookie（Netscape 格式）
zh_hant: Cookie（Netscape 格式）

# settings_clear_cookies_button
source: Clear
es: Limpiar
fr: Effacer
hi: साफ़ करें
ja: クリア
ru: Очистить
zh_hans: 清除
zh_hant: 清除

# status_remuxing_preserving_quality
source: Remuxing to %@ (preserving quality)...
es: Remultiplexando a %@ (manteniendo la calidad)…
fr: Remux vers %@ (conservation de la qualité)…
hi: %@ में रिमक्स किया जा रहा है (गुणवत्ता बनाए रखते हुए)…
ja: %@ へリマックス中（品質保持）…
ru: Ремукс в %@ (без потери качества)…
zh_hans: 正在重新封装到 %@（保留质量）…
zh_hant: 正在重新封裝成 %@（保持品質）…

# status_remux_complete
source: Remuxing completed successfully!
es: Remultiplexado completado correctamente.
fr: Remux terminé avec succès !
hi: रिमक्स सफलतापूर्वक पूरा हुआ!
ja: リマックスが完了しました！
ru: Ремукс успешно завершён!
zh_hans: 重新封装完成！
zh_hant: 重新封裝完成！
